Revit 2027 API
ParameterTypeId.ViewAnalysisDisplayStyle Property
 "Default Analysis Display Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewAnalysisDisplayStyle { get; }
Public Shared ReadOnly Property ViewAnalysisDisplayStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewAnalysisDisplayStyle {
	ForgeTypeId^ get ();
}
static member ViewAnalysisDisplayStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace